In [1]:
# Preparação de Dados e Avaliação de Modelos

In [2]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [3]:
# Criando um DataFrame de exemplo com um valor NA
df = pd.DataFrame({
    'Nome': ['Ana', 'Bruno', 'Carlos'],
    'Idade': [28, np.nan, 34],
    'Sexo': ['F', 'M', 'M']
})
print(df)

     Nome  Idade Sexo
0     Ana   28.0    F
1   Bruno    NaN    M
2  Carlos   34.0    M

In [4]:
df.dropna()

     Nome  Idade Sexo
0     Ana   28.0    F
2  Carlos   34.0    M

In [5]:
df

     Nome  Idade Sexo
0     Ana   28.0    F
1   Bruno    NaN    M
2  Carlos   34.0    M

In [6]:
df.dropna(inplace=True)

## RSME e MAPE

In [ ]:
# RMSE sem o sckit-learn
# Valores reais
reais = [100000, 150000, 200000, 250000, 300000]
 
# Valores previstos pelo modelo
prev = [95000, 142000, 210000, 245000, 315000]
 
# Cálculo do RMSE
diferencas = [r - p for r, p in zip(reais, prev)]
quadrados_das_diferencas = [d ** 2 for d in diferencas]
mse = np.mean(quadrados_das_diferencas)
rmse = np.sqrt(mse)
 
print(f"MSE: {mse}\nRMSE: {rmse}")

MSE: 87800000.0
RMSE: 9370.165420097983

In [9]:
# RMSE com scikit-learn and built-in functions
from sklearn.metrics import mean_squared_error

# Valores reais
reais = [100000, 150000, 200000, 250000, 300000]
 
# Valores previstos pelo modelo
prev = [95000, 142000, 210000, 245000, 315000]

mse = mean_squared_error(reais, prev)
rmse = np.sqrt(mse)

print(f"MSE: {mse}\nRMSE: {rmse}")

MSE: 87800000.0
RMSE: 9370.165420097983

In [ ]:
# MAPE sem scikit-learn